{"metadata":{"title":"COmments on a static site","date":"May 30, 2021","excerpt":"With a static page blog you have to select a solution to att comments. Doing some investigations pointed to...."},"content":"<p>With a static page blog you have to select a solution to att comments. Doing some investigations pointed to <a href=\"https://utteranc.es/\">utterances</a>. The setup looked slim. Just put this in your code:</p>\n<pre><code class=\"hljs language-js\">&#x3C;script src=<span class=\"hljs-string\">\"https://utteranc.es/client.js\"</span> \n        repo=<span class=\"hljs-string\">\"githubname/repo\"</span>\n        issue-term=<span class=\"hljs-string\">\"pathname\"</span>\n        label=<span class=\"hljs-string\">\"Comments\"</span>\n        theme=<span class=\"hljs-string\">\"github-light\"</span>\n        crossorigin=<span class=\"hljs-string\">\"anonymous\"</span>\n        <span class=\"hljs-keyword\">async</span>>\n&#x3C;/script>\n</code></pre>\n<p>Where repo should just be githubname/repo, not <a href=\"https://github.xxxxxx/xxxxxx\">https://github.xxxxxx/xxxxxx</a>. Should ypu choose to use label as I did you have to add it to your issue labels if it doesn't exist.</p>\n<h2>\"message\": \"No commit found for the ref master\" utterances.</h2>\n<p>This was the error meddage I found with dev tools when trying to submit a message from the blog. With new repositories having no master bu instead a main branch since a while I just added a branch called master and that error message disappeared.</p>\n<h2>\"message\":\"At least one email address must be verified to do that</h2>\n<p>This was the next error message that I got. I looked at utteran.es issus and did not find any. Doublechecked that my github account had a verified email address. With that checked I thought that there probably was something with the utterances-bot that maybe had a non verified address or that i maybe was removed or something. Today I was ready to submit a issue but then I found a new issue with the same error. I did a reply that I had the same error and that it might be the bots email. There where a reply in the issue pointing out that if you manually create the issue in the repo it works. This was a good workaround so now I could go with utterances!</p>\n<h2>Adding some additional security.</h2>\n<p>The setup doesn't check from where the messager origins. If a site is forked or if someone is just doing it for fun messages could be send from anywhere. Looking around i found <a href=\"https://github.com/utterance/utterances/issues/108\">this post</a>. Just adding the file utterances.json to your root in the repository with this:</p>\n<pre><code class=\"hljs language-js\">{\n  <span class=\"hljs-string\">\"origins\"</span>: [<span class=\"hljs-string\">\"https://yoursite/\"</span>]\n}\n</code></pre>"}